const responseHelper = require('../util/responseHelper');
const request = require('../util/request');
const dataRoutes = require('../const/dataRoutes');
const pickArrayFields = require('../util/pickArrayFields');

const facultyRoutes = router => {
  router.route('/test/list')
    .get((req, res, next) => {
      const { method, url } = dataRoutes.category;
      const { subjectId } = req.query;

      const responseSample = [{"id":"1825","name":"1. Хірургічна операція та інструментарій. Підготовка інструментального столика і в’язання вузлів. Визначення і завдання дисципліни, історія становлення та методи дослідження. Поняття про хірургічні операції."},{"id":"1826","name":"2. Роз’єднання і з’єднання тканин. Первинна хірургічна обробка рани."},{"id":"1827","name":"﻿3. Топографічна анатомія грудної стінки, молочної залози, діафрагми, плеври і легень. Операції на них. Первинна хірургічна обробка ран грудної клітки."},{"id":"1828","name":"﻿4. Топографічна анатомія середостіння, перикарду та серця. Пункція перикарду. Ушивання рани серця. Операції при вроджених і набутих вадах серця."},{"id":"2609","name":"Топографо-анатомічне обгрунтування операцій на голові,шиї та кінцівках"},{"id":"1896","name":"﻿5 Топографічна анатомія передньої-бокової стінки живота. Доступи до органів черевної порожнини. Поняття про грижі."},{"id":"1906","name":"6. Хірургічна анатомія та оперативне лікування пахвинних гриж."},{"id":"1907","name":"7. Хірургічна анатомія стегнових та пупкових гриж та гриж білої лінії живота. Операції на них."},{"id":"1908","name":"8. Топографічна анатомія і ревізія верхнього та нижнього поверхів черевної порожнини. Пункція черевної порожнини."},{"id":"1909","name":"9. Принципи абдомінальної хірургії. Кишкові шви. Топографічна анатомія тонкої кишки та ушивання ран на ній."},{"id":"1910","name":"10.Резекція тонкої кишки з формуванням анастомозів “кінець в кінець” та “бік в бік”. Формування кукси кишки."},{"id":"1911","name":"11 Топографічна анатомія товстої кишки. Операції на товстій кишці. Калові нориці та апендектомії."},{"id":"1912","name":"12 Топографічна анатомія та хірургія шлунку. Гастростомія. Ушивання проривної виразки. Топографічна анатомія селезінки та підшлункової залози. Операції на них."},{"id":"1913","name":"13 Топографічна анатомія печінки, жовчного міхура і жовчних шляхів. Операції на них."},{"id":"1914","name":"14 Топографічна анатомія поперекової ділянки і заочеревинного простору. Паранефральна блокада. Операції на нирках і сечоводах. Топографічна анатомія хребта і спинного мозку. Операції на них."},{"id":"1915","name":"15 Топографічна анатомія тазу. Доступи для дренування гнійних процесів."},{"id":"1916","name":"16 Топографічна анатомія промежини і зовнішніх статевих органів. Операції на органах тазу."},{"id":"1977","name":"(СП)Топографо-анатомічне обґрунтування операцій на тулубі людини"},{"id":"2280","name":"Топографічна анатомія мозкового відділу голови. Первинна хірургічна обробка ран непроникаючих ран мозкового відділу голови. Артротомія."},{"id":"2281","name":"ТОПОГРАФІЧНА АНАТОМІЯ МОЗКОВИХ ОБОЛОНОК. ТРЕПАНАЦІЯ ЧЕРЕПА."},{"id":"2282","name":"ТОПОГРАФІЧНА АНАТОМІЯ ЛИЦЕВОЇ ДІЛЯНКИ ГОЛОВИ. БЛОКАДА ШКІРНИХ ГІЛОК ТРІЙЧАСТОГО НЕРВА. РОЗРІЗИ ПРИ ГНІЙНИКАХ НА ЛИЦІ"},{"id":"2283","name":"ТОПОГРАФІЧНА АНАТОМІЯ ПЕРЕДНЬОЇ ДІЛЯНКИ ШИЇ. РОЗКРИТТЯ КЛІТКОВИННИХ ПРОСТОРІВ ПРИ ФЛЕГМОНАХ. ВАГОСИМПАТИЧНА БЛОКАДА."},{"id":"2284","name":"ТОПОГРАФІЧНА АНАТОМІЯ ОРГАНІВ ШИЇ ТА ОПЕРАЦІЇ НА НИХ. ПЕРЕВ’ЯЗКА СОННИХ АРТЕРІЙ. ТРАХЕОТОМІЯ."},{"id":"2285","name":"ВЕНЕПУНКЦІЯ, ВЕНЕСЕКЦІЯ ТА ТРАХЕОТОМІЯ (ОПЕРАЦІЯ НА ТВАРИНІ НА ЕКСПЕРИМЕНТАЛЬНІЙ БАЗІ"},{"id":"2286","name":"ТОПОГРАФІЧНА АНАТОМІЯ НАДПЛІЧЧЯ, ПЛЕЧА І ДІЛЯНКИ ЛІКТЬОВОГО СУГЛОБУ. ДОСТУПИ ДО ПАХВОВОЇ ТА ПЛЕЧОВОЇ АРТЕРІЙ."},{"id":"2287","name":"“ТОПОГРАФІЧНА АНАТОМІЯ ПЕРЕДПЛІЧЧЯ І КИСТІ. ОПЕРАЦІЇ ПРИ ГНІЙНИХ ПРОЦЕСАХ. ОПЕРАЦІЇ НА СУХОЖИЛКАХ"},{"id":"2288","name":"“ЗАГАЛЬНА ХАРАКТЕРИСТИКА НИЖНЬОЇ КІНЦІВКИ. ТОПОГРАФІЧНА АНАТОМІЯ СІДНИЧНОЇ ДІЛЯНКИ І СТЕГНА. ПУНКЦІЯ КУЛЬШОВОГО СУГЛОБА. ОПЕРАЦІЇ НА СУДИНАХ”"},{"id":"2289","name":"“ТОПОГРАФІЧНА АНАТОМІЯ ДІЛЯНОК КОЛІННОГО СУГЛОБА, ГОМІЛКИ І СТОПИ. ПУНКЦІЯ КОЛІННОГО СУГЛОБА. ОПЕРАЦІЇ НА НЕРВАХ”."},{"id":"2290","name":"ОПЕРАЦІЇ НА ДОВГИХ ТРУБЧАСТИХ КІСТКАХ ТА СУГЛОБАХ."},{"id":"2291","name":"Ампутації та екзартикуляції."}];
      responseHelper.operationSuccess(res, responseSample);

      // request({
      //   method,
      //   url,
      //   data: { id: subjectId, lang: 1 },
      // })
      //   .then(({ data }) => {
      //     const normalizedData = pickArrayFields(data, ['id', 'name']);
      //     responseHelper.operationSuccess(res, normalizedData);
      //   })
      //   .catch((err) => {
      //     console.log(err);
      //     responseHelper.oparationFailed('Retrieveing tests list error');
      //     // Todo add global error handler
      //   });
    });

  return router;
};

module.exports = facultyRoutes;
